app/Jobs/Shopify/Sync/OneOrder.php

update `orders` set `subtotal_price` = 980, `total_price` = '1030.00' where `id` = 5897189884196
---
                            $total_shipping += $ship['price'];
                        }
                        $db_order->subtotal_price = $temp_payload['total_price'] - $total_shipping;
                        $db_order->save();

select * from `refunds` where `refund_id` = 969973039396 and `line_item_id` = 14998028026148 limit 1
---
                            foreach($ref->refund_line_items as $key=>$line) {
                                if($line && isset($line->line_item_id))
                                {
                                    $refund = Refund::where('refund_id', json_decode($temp_payload['refunds'])[0]->id)->where('line_item_id',$line->line_item_id)->first();

update `refunds` set `created_at` = '2024-07-13 11:52:01', `updated_at` = '2024-07-13 11:52:01' where `id` = 1623
update `orders` set `total_price` = 740 where `id` = 5897189884196
---
                                    $refund->line_item_id = $line->line_item_id;
                                    $refund->created_at = now();
                                    $refund->updated_at = now();
                                    $refund->save();

                                    if($db_order) {
                                        $db_order->total_price -= $refund->amount;
                                        $db_order->save();