app/Http/Controllers/ShopifyController.php

select count(*) as aggregate from `prepare_product_lists` where exists (select * from `prepares` where `prepare_product_lists`.`prepare_id` = `prepares`.`id` and `delivery_status` = 'hold') and `product_status` != 'prepared'
---
    public function hold_products(Request $request)
    {
        $date = $request->date;
        $hold_date = null;
        $delivery_status = null;

        $products = PrepareProductList::whereHas('prepare', function ($q) {
            return $q->where('delivery_status', 'hold');
        })->where('product_status', '!=', 'prepared');

        if($date !=null)
        {
            $products = $products->whereDate('created_at', '=',$date);

        }

        if($hold_date !=null)
        {
            $products = $products->whereDate('updated_at', '=',$date);
        }
        if($request->delivery_status)
        {
            $delivery_status = $request->delivery_status;
            $products = $products->where('product_status', $delivery_status);
        }


        $products_count = $products->count();

select * from `prepares`
---
            return $this->export_hold_products($products->get());
        }
        $products = $products->orderBy('created_at','desc')->simplePaginate(15);
        $orders = Prepare::all();

select * from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null
select * from `orders` where `orders`.`store_id` = 1 and `orders`.`store_id` is not null
---
    public function all_orders(Request $request) {

        $date = $request->date;
        $sort_search = null;
        $delivery_status = null;
        $payment_status = '';
        $prepare_users_list = [];

        $user = Auth::user();
        $store = $user->getShopifyStore;
        $orders = $store->getPrepares();

        $all_orders = $store->getOrders()->get();

        $all_prepares = $orders->get();

select * from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null and `delivery_status` = 'distributed' and `assign_to` = 28 order by `table_id` asc limit 16 offset 0
---
    public function new_orders() {
        $user = Auth::user();
        $store = $user->getShopifyStore;
        if($user->id == 1 || $user->id == 2)
        $orders = $store->getPrepares()->where('delivery_status','distributed')->orderBy('table_id', 'desc')
                ->simplePaginate(15);
        else
        $orders = $store->getPrepares()->where('delivery_status','distributed')
                ->where('assign_to',$user->id)->orderBy('table_id', 'asc')
                ->simplePaginate(15);

select * from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null and `delivery_status` = 'hold' and `assign_to` = 12 order by `table_id` desc limit 16 offset 0
---
    public function hold_orders() {
        $user = Auth::user();
        $store = $user->getShopifyStore;
        if($user->id == 1 || $user->id == 2)
        $orders = $store->getPrepares()->where('delivery_status','hold')->orderBy('table_id', 'desc')
                ->simplePaginate(15);
        else
        $orders = $store->getPrepares()->where('delivery_status','hold')
                ->where('assign_to',$user->id)->orderBy('table_id', 'desc')
                ->simplePaginate(15);

select * from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null and date(`created_at`) >= '2024-07-13' and date(`created_at`) <= '2024-07-13'
---
    public function staff_report(Request $request)
    {
        $date = $request->date;
        $sort_search = null;
        $delivery_status = null;
        $prepare_users_list = [];
        $daterange = null;

        $user = Auth::user();
        $store = $user->getShopifyStore;
        $orders = $store->getPrepares();

        if($request->delivery_status) {
            $delivery_status = $request->delivery_status;
            $orders = $orders->where('delivery_status', $delivery_status);

        }
        if ($request->search) {
            $sort_search = $request->search;
            $orders = $orders->where('delivery_status', 'like', '%' . $sort_search . '%')
                ->orWhereHas('user', function ($q)use($sort_search) {
                    return $q->where('name', 'like', '%' . $sort_search . '%');
                });

select * from `users` where `role_id` = '5'
---

        $all_prepares = $orders->get();

        $prepare_users = User::where('role_id', '5')->get();

select * from `orders` where `name` like '%13380%' limit 1
---

        if ($request->search) {
            $sort_search = $request->search;
            $returns = $returns->where('order_number', 'like', '%' . $sort_search . '%')
                ->orWhere('return_number', 'like', '%' . $sort_search . '%')
                ->orWhere('status', 'like', '%' . $sort_search . '%')
                ->orWhereHas('order', function ($q)use($sort_search) {
                    return $q->where('name', 'like', '%' . $sort_search . '%')
                    ->orWhere('phone', 'like', '%' . $sort_search . '%')
                    ->orWhere('shipping_address', 'like', '%' . $sort_search . '%')
                    ->orWhere('email', 'like', '%' . $sort_search . '%');
                });

select * from `prepares` where `order_id` = 5899598463268 limit 1
select * from `prepare_product_lists` where `prepare_id` = 12060 limit 1
select `line_item_id` from `refunds` where `order_name` = '#14072'
select `id` from `returned_orders` where `order_number` = '14072'
---
    public function prepareOrder($id)
    {
        $user = Auth::user();
        $store = $user->getShopifyStore;
        $order = order2::where('name','like','%'. $id.'%')->first();
        if(!$order)
        $order = Sale::where('name','like','%'. $id.'%')->first();

        if ($user->role_id == 6 && $order->fulfillment_status != "shipped")
            return redirect()->back()->with('error',"Youre not permitted to view this page");

        $product_images = $store->getProductImagesForOrder($order);

        $prepare = Prepare::where('order_id', $order->id)->first();

        $prepare_products = PrepareProductList::where('prepare_id', $prepare->id)->first();
        $refunds = Refund::where('order_name', $order->name)->pluck('line_item_id')->toArray();
        $returns = [];
        $return = ReturnedOrder::where('order_number', $order->order_number)->pluck('id')->toArray();

select * from `orders` where `orders`.`store_id` = 1 and `orders`.`store_id` is not null and `table_id` = '19700' limit 1
select `line_item_id` from `refunds` where `order_name` = '#14015'
---
    public function showOrder($id) {
        $user = Auth::user();
        $store = $user->getShopifyStore;
        $order = $store->getOrders()->where('table_id', $id)->first();
        if($order->getFulfillmentOrderDataInfo()->doesntExist())
            OrderFulfillments::dispatch($user, $store, $order);
        $product_images = $store->getProductImagesForOrder($order);
        $refunds = Refund::where('order_name', $order->name)->pluck('line_item_id')->toArray();

select * from `prepares` where `order_id` = '5896298430756' limit 1
select `line_item_id` from `refunds` where `order_name` = '#13863'
---
    public function review_order($id)
    {
        $order = order2::where('id', $id)->first();
        $prepare = Prepare::where('order_id', $id)->first();
        $order_currency=getCurrencySymbol($order->currency);
        $user = Auth::user();
        $store = $user->getShopifyStore;
        $product_images = $store->getProductImagesForOrder($order);
        $refunds = Refund::where('order_name', $order->name)->pluck('line_item_id')->toArray();

select * from `prepares` where `order_id` = 5897189884196 limit 1
select `line_item_id` from `refunds` where `order_name` = '#13931'
select * from `orders` where `order_number` = '13931' limit 1
update `orders` set `fulfillment_status` = 'reviewed', `status` = 8 where `id` = 5897189884196
update `prepares` set `delivery_status` = 'reviewed' where `id` = 12326
---
    public function review_post(Request $request)
    {
        $data = $request->all();
        $auth_id = auth()->user()->id;
        $auth_user = auth()->user()->name;
        $user = Auth::user();
        $store = $user->getShopifyStore;

        $order = order2::where('order_number', $request['order_id'])->first();
        $prepare = Prepare::where('order_id', $order->id)->first();
        $refunds = Refund::where('order_name', $order->name)->pluck('line_item_id')->toArray();

        if($order->getFulfillmentOrderDataInfo()->doesntExist()){
            OrderFulfillments::dispatch($user, $store, $order);
        }

        if($order)
        {
            $order->fulfillment_status = "reviewed";
            $order->status = 8;
            $order->save();
            $data['name'] = $order->name;
        }
        if($prepare)
        {
            $prepare->delivery_status = 'reviewed';
            $prepare->save();

select * from `prepare_product_lists` where `product_id` = '14998028026148' and `order_id` = 5897189884196 limit 1
---
        $posted_data2 = [];
        foreach ($request['line_item_id'] as $key => $item) {

            $prepare_product = PrepareProductList::where('product_id', $item)->where('order_id', $order->id)->first();

update `prepares` set `delivery_status` = 'fulfilled' where `id` = 12326
---
        if ($prepare->delivery_status != "fulfilled")
        {
            $prepare->delivery_status = 'fulfilled';
            $prepare->save();

update `orders` set `fulfillment_status` = 'fulfilled', `status` = 10 where `id` = 5897189884196
---
        {
            $order->fulfillment_status = "fulfilled";
            $order->status = 10;
            $order->save();

select `line_item_id` from `refunds` where `order_name` = '#13742'
select * from `prepare_product_lists` where `order_id` = '5894165987620' and `table_id` = 19054 and `product_id` not in (14989248069924, 14989248102692)
---
    public function generate_invoice($id)
    {
        $order = order2::findOrFail($id);
        $refunds = Refund::where('order_name', $order->name)->pluck('line_item_id')->toArray();
        $order_details = PrepareProductList::where('order_id', $id)->where('table_id', $order->table_id)->whereNotIn('product_id',$refunds)->get();

select * from `order_histories` where `order_id` = '5897271673124'
---
    public function order_history($id)
    {
        $order = order2::findOrFail($id);

        $order_history = OrderHistory::where('order_id',$id)->get();

select * from `orders` where `orders`.`id` = '5899197972772' limit 1
update `orders` set `fulfillment_status` = 'cancelled', `status` = '14' where `id` = 5899197972772
select * from `prepares` where `order_id` = 5899197972772 limit 1
delete from `prepares` where `id` = 12025
select * from `prepare_product_lists` where `order_id` = 5899197972772
select * from `prepare_product_lists` where `prepare_product_lists`.`id` = 36317 limit 1
delete from `prepare_product_lists` where `id` = 36317
---
    public function update_delivery_status(Request $request)
    {
        if($request->status == 'cancelled') {
            $user = Auth::user();
            $store = $user->getShopifyStore;
            $order = order2::findOrFail($request->order_id);
            $order->fulfillment_status = $request->status;
            $order->status = '14';


            $order->save();
            $get_prepare_order = Prepare::where('order_id',$order->id)->first();

            if($get_prepare_order){

                $get_prepare_order->delete();
                $get_prepare_order_details = PrepareProductList::where('order_id',$order->id)->get();
                if(count($get_prepare_order_details)){
                    foreach ($get_prepare_order_details as $detail) {
                        $detail_record = PrepareProductList::find($detail->id);
                        $detail_record->delete();

select * from `orders` where `orders`.`store_id` = 1 and `orders`.`store_id` is not null and `table_id` = 19663 limit 1
select * from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null and `table_id` = 19663 limit 1
select * from `prepare_product_lists` where `product_id` = '15019095097636' and `order_id` = 5904814965028 limit 1
---
    public function fulfillOrderItems(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'product_status.*' => 'required',]
            , [
                'product_status.*.required' => 'This field is required.',
            ]);

        if ($validator->fails()) {
            return redirect()->back()->withErrors($validator)->withInput();
        }
        $request = $request->all();
        $posted_data = [];
        $user = Auth::user();
        $store = $user->getShopifyStore;
        $order = $store->getOrders()->where('table_id', (int) $request['order_id'])->first();
        $prepare = $store->getPrepares()->where('table_id',(int) $request['order_id'])->first();
        if ($prepare->delivery_status == "hold")
            $old_page = "prepare.hold";
        else
            $old_page = "prepare.new";
        $prepare->delivery_status = "prepared";
        $order->fulfillment_status = "prepared";
        foreach($request['line_item_id'] as $key => $item)
        {
            $prepare_product = PrepareProductList::where('product_id', $item)->where('order_id', $order->id)->first();

update `orders` set `fulfillment_status` = 'hold' where `id` = 5904814965028
update `prepares` set `delivery_status` = 'hold', `updated_at` = '2024-07-13 12:41:52' where `id` = 12289
---
            }
            $prepare_product->save();
        }
        $order->save();
        $prepare->save();

select * from `prepare_product_lists` where `product_id` in ('15019095097636', '15019095130404', '15019095163172', '15019095195940', '15019095228708', '15019095261476') and `order_id` = 5904814965028
---
            $add_History_sale->save();
        }
        else{
            $prepare_product = PrepareProductList::whereIn('product_id', $request['line_item_id'])->where('order_id', $order->id)->get();

select * from `orders` where `name` = '#14104' limit 1
select * from `prepares` where `order_id` = 5900094767396 limit 1
select * from `prepare_product_lists` where `order_id` = 5900094767396
insert into `resynced_orders` (`order_id`, `old_status`, `reason`, `assign_to`, `synced_by`, `old_total`, `created_at`, `updated_at`) values ('#14104', 'distributed', 'Remove Item', 12, 10, '1240', '2024-07-13 12:56:17', '2024-07-13 12:56:17')
delete from `prepares` where `id` = 12342
---
    public function resync_order(Request $request)
    {
        $id = str_replace('#','',$request->order_id);
        $id = '#' . $id;
        $old = order2::where('name',$id)->first();
        $order_id = null;
        $resync = null;
        if($old)
        {
            $order_id = $old->id;
            $prepare = Prepare::where('order_id', $old->id)->first();
            if($prepare)
            {

                $products = PrepareProductList::where('order_id',$old->id)->get();
                foreach($products as $product)
                {
                    $product->delete();
                }
            }
            $resync = new ResyncedOrder();
            $resync->order_id = $old->name;
            $resync->old_status = $old->fulfillment_status;
            $resync->reason = $request->reason;
            $resync->assign_to = $prepare?$prepare->assign_to:null;
            $resync->synced_by = Auth::user()->id;
            $resync->old_total = $old->total_price;
            $resync->created_at = now();
            $resync->updated_at = now();
            $resync->save();

            $old->delete();
            if($prepare)
            $prepare->delete();